# -*- encoding:utf-8 -*-
b='姓名：司建伟\t学号：1403050117\t班级：通风一班\n'
print b.decode("utf-8")
a1='\t\t忆故乡---酸汤子\t\t\t\t\t\t\t\t\t\n朦胧中,回到故乡,故乡的小河在月色下闪着磷光,\n哗啦啦地流淌着好像在欢迎我回来,溅起的浪花,\n仿佛儿时的伙伴拉着我的手话着离别时光.\n'
a2='踏上这片热土,回到就别的故乡心是热的泪水也是滚\n烫的.突然一群小伙伴不知道从哪里飞出来,将我团团\n围住.啊!故乡的月色迷人,故乡的人啊格外亲!\n'
a3='被小伙伴们推搡着,走进谁的家?锅灶上冒着热气,是\n谁的妈妈在忙碌着?深深地吸上一口气,哇!真香,那\n可是我搜肠刮肚寻觅的味道.只见一锅酸汤子在沸水里\n滚动着,我们坐在饭桌前静静地等一碗一碗地酸汤子摆\n在我们面前.\n'
a4='一碗酸汤子勾起我儿时美好的回忆,一碗酸汤子让我这\n个漂泊在外的游子梦归故里.\n\n\t\t\t\t图/文本紫花飘香'
print a1.decode("utf-8")
print a2.decode("utf-8")
print a3.decode("utf-8")
print a4.decode("utf-8")